jmeter-teastore/jmeter.log
2025-10-14 04:23:17,710 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-10-14 04:23:17,756 INFO o.a.j.JMeter: Loading user properties from: /opt/apache-jmeter-5.5/bin/user.properties
2025-10-14 04:23:17,758 INFO o.a.j.JMeter: Loading system properties from: /opt/apache-jmeter-5.5/bin/system.properties
2025-10-14 04:23:17,759 INFO o.a.j.JMeter: Setting System property: log4j2.formatMsgNoLookups=true
2025-10-14 04:23:17,773 INFO o.a.j.JMeter: Copyright (c) 1998-2022 The Apache Software Foundation
2025-10-14 04:23:17,774 INFO o.a.j.JMeter: Version 5.5
2025-10-14 04:23:17,774 INFO o.a.j.JMeter: java.version=1.8.0_275
2025-10-14 04:23:17,775 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-10-14 04:23:17,776 INFO o.a.j.JMeter: os.name=Linux
2025-10-14 04:23:17,776 INFO o.a.j.JMeter: os.arch=amd64
2025-10-14 04:23:17,777 INFO o.a.j.JMeter: os.version=6.6.87.2-microsoft-standard-WSL2
2025-10-14 04:23:17,777 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-10-14 04:23:17,778 INFO o.a.j.JMeter: java.awt.headless=true
2025-10-14 04:23:17,778 INFO o.a.j.JMeter: Max memory     =3246391296
2025-10-14 04:23:17,779 INFO o.a.j.JMeter: Available Processors =12
2025-10-14 04:23:17,789 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-10-14 04:23:17,790 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-10-14 04:23:17,791 INFO o.a.j.JMeter: JMeterHome=/opt/apache-jmeter-5.5
2025-10-14 04:23:17,791 INFO o.a.j.JMeter: user.dir  =/app
2025-10-14 04:23:17,792 INFO o.a.j.JMeter: PWD       =/app
2025-10-14 04:23:17,793 INFO o.a.j.JMeter: IP: 172.17.0.2 Name: af7203fd43ca FullName: af7203fd43ca
2025-10-14 04:23:17,826 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/app/report'
2025-10-14 04:23:17,843 INFO o.a.j.s.FileServer: Default base='/app'
2025-10-14 04:23:17,852 INFO o.a.j.s.FileServer: Set new base='/app'
2025-10-14 04:23:18,225 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-10-14 04:23:18,255 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-10-14 04:23:18,263 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-10-14 04:23:18,278 INFO o.a.j.s.SaveService: Loading file: teste-carga-simples.jmx
2025-10-14 04:23:18,424 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-14 04:23:18,425 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-14 04:23:18,425 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-14 04:23:18,425 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-10-14 04:23:18,426 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-10-14 04:23:18,426 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-10-14 04:23:19,128 INFO o.a.j.JMeter: Creating summariser <summary>
2025-10-14 04:23:19,326 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2025-10-14 04:23:19,328 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: results.jtl
2025-10-14 04:23:19,328 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /opt/apache-jmeter-5.5/bin/reportgenerator.properties
2025-10-14 04:23:19,329 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2025-10-14 04:23:19,335 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2025-10-14 04:23:19,338 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2025-10-14 04:23:19,339 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2025-10-14 04:23:19,340 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2025-10-14 04:23:19,340 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2025-10-14 04:23:19,341 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2025-10-14 04:23:19,341 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2025-10-14 04:23:19,342 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2025-10-14 04:23:19,342 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2025-10-14 04:23:19,346 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,347 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,348 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,348 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,349 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,349 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,350 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,351 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,351 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,352 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2025-10-14 04:23:19,353 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2025-10-14 04:23:19,354 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2025-10-14 04:23:19,355 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2025-10-14 04:23:19,356 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2025-10-14 04:23:19,356 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2025-10-14 04:23:19,357 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2025-10-14 04:23:19,366 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-10-14 04:23:19,367 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-14 04:23:19,367 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-10-14 04:23:19,375 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-10-14 04:23:19,376 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-10-14 04:23:19,702 INFO o.a.j.JMeter: Running test (1760408599702)
2025-10-14 04:23:19,912 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Grupo de Usuários - Carga Simples
2025-10-14 04:23:19,913 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Grupo de Usuários - Carga Simples.
2025-10-14 04:23:19,914 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-10-14 04:23:19,918 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=1 delayedStart=false
2025-10-14 04:23:19,932 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-1
2025-10-14 04:23:19,937 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-10-14 04:23:19,938 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-10-14 04:23:20,028 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-2
2025-10-14 04:23:20,128 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-3
2025-10-14 04:23:20,226 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-4
2025-10-14 04:23:20,325 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-5
2025-10-14 04:23:20,423 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-6
2025-10-14 04:23:20,524 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-7
2025-10-14 04:23:20,622 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-8
2025-10-14 04:23:20,723 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-9
2025-10-14 04:23:20,821 INFO o.a.j.t.JMeterThread: Thread started: Grupo de Usuários - Carga Simples 1-10
2025-10-14 04:23:20,964 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = af7203fd43ca
2025-10-14 04:23:20,971 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-10-14 04:23:20,973 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-10-14 04:23:20,974 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2025-10-14 04:23:20,975 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-10-14 04:23:20,976 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-10-14 04:23:30,531 INFO o.a.j.r.Summariser: summary +     91 in 00:00:11 =    8.4/s Avg:    30 Min:    10 Max:   138 Err:     0 (0.00%) Active: 10 Started: 10 Finished: 0
2025-10-14 04:23:49,033 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-7
2025-10-14 04:23:49,249 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-8
2025-10-14 04:23:49,250 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-9
2025-10-14 04:23:49,323 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-10
2025-10-14 04:23:49,904 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-4
2025-10-14 04:23:49,907 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-2
2025-10-14 04:23:49,913 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-3
2025-10-14 04:23:49,914 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-5
2025-10-14 04:23:49,916 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-1
2025-10-14 04:23:49,925 INFO o.a.j.t.JMeterThread: Thread finished: Grupo de Usuários - Carga Simples 1-6
2025-10-14 04:23:49,926 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-10-14 04:23:49,928 INFO o.a.j.r.Summariser: summary +    195 in 00:00:19 =   10.0/s Avg:    17 Min:     8 Max:    48 Err:     0 (0.00%) Active: 0 Started: 10 Finished: 10
2025-10-14 04:23:49,929 INFO o.a.j.r.Summariser: summary =    286 in 00:00:30 =    9.5/s Avg:    21 Min:     8 Max:   138 Err:     0 (0.00%)
2025-10-14 04:23:49,930 INFO o.a.j.JMeter: Generating Dashboard
2025-10-14 04:23:49,930 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2025-10-14 04:23:49,953 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2025-10-14 04:23:50,067 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2025-10-14 04:23:50,068 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2025-10-14 04:23:50,069 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2025-10-14 04:23:50,070 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2025-10-14 04:23:50,073 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2025-10-14 04:23:50,076 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2025-10-14 04:23:50,077 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2025-10-14 04:23:50,077 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2025-10-14 04:23:50,113 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2025-10-14 04:23:50,114 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2025-10-14 04:23:50,115 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2025-10-14 04:23:50,115 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2025-10-14 04:23:50,221 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2025-10-14 04:23:50,221 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 2002 samples
2025-10-14 04:23:50,222 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2025-10-14 04:23:50,223 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2025-10-14 04:23:50,224 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2025-10-14 04:23:50,225 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2025-10-14 04:23:50,225 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2025-10-14 04:23:50,229 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2025-10-14 04:23:50,230 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2025-10-14 04:23:50,231 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2025-10-14 04:23:50,231 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2025-10-14 04:23:50,231 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2025-10-14 04:23:50,232 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 4290 samples
2025-10-14 04:23:50,232 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 858 samples
2025-10-14 04:23:50,232 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 286 samples
2025-10-14 04:23:50,233 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 286 samples produced in 254ms on channel 0
2025-10-14 04:23:50,233 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2025-10-14 04:23:50,318 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2025-10-14 04:23:50,319 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2025-10-14 04:23:50,320 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2025-10-14 04:23:50,320 INFO o.a.j.r.d.JsonExporter: Checking output folder
2025-10-14 04:23:50,324 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /app/report/statistics.json
2025-10-14 04:23:50,355 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2025-10-14 04:23:50,361 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /app/report
2025-10-14 04:23:50,436 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /app/report, creating folder structure
2025-10-14 04:23:50,448 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/opt/apache-jmeter-5.5/bin/report-template' to '/app/report', got message: /app/report, found non empty folder with following content [/app/report/statistics.json], will be ignored
2025-10-14 04:23:51,563 INFO o.a.j.JMeter: Dashboard generated