jmeter-teastore/jmeter_run.log
2025-11-17 16:07:48,764 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-11-17 16:07:48,793 INFO o.a.j.JMeter: Loading user properties from: C:\Users\Elris\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\user.properties
2025-11-17 16:07:48,793 INFO o.a.j.JMeter: Loading system properties from: C:\Users\Elris\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3\bin\system.properties
2025-11-17 16:07:48,793 INFO o.a.j.JMeter: Setting JMeter property: hostname=localhost
2025-11-17 16:07:48,794 INFO o.a.j.JMeter: Setting JMeter property: port=8080
2025-11-17 16:07:48,794 INFO o.a.j.JMeter: Setting JMeter property: basePath=/tools.descartes.teastore.webui
2025-11-17 16:07:48,806 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-11-17 16:07:48,806 INFO o.a.j.JMeter: Version 5.6.3
2025-11-17 16:07:48,806 INFO o.a.j.JMeter: java.version=17.0.16
2025-11-17 16:07:48,806 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-11-17 16:07:48,807 INFO o.a.j.JMeter: os.name=Windows 11
2025-11-17 16:07:48,807 INFO o.a.j.JMeter: os.arch=amd64
2025-11-17 16:07:48,807 INFO o.a.j.JMeter: os.version=10.0
2025-11-17 16:07:48,807 INFO o.a.j.JMeter: file.encoding=Cp1252
2025-11-17 16:07:48,807 INFO o.a.j.JMeter: java.awt.headless=true
2025-11-17 16:07:48,807 INFO o.a.j.JMeter: Max memory     =1073741824
2025-11-17 16:07:48,807 INFO o.a.j.JMeter: Available Processors =12
2025-11-17 16:07:48,821 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-11-17 16:07:48,821 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-11-17 16:07:48,821 INFO o.a.j.JMeter: JMeterHome=C:\Users\Elris\Downloads\apache-jmeter-5.6.3\apache-jmeter-5.6.3
2025-11-17 16:07:48,821 INFO o.a.j.JMeter: user.dir  =C:\Users\Elris\Documents\projects
2025-11-17 16:07:48,822 INFO o.a.j.JMeter: PWD       =C:\Users\Elris\Documents\projects
2025-11-17 16:07:48,829 INFO o.a.j.JMeter: IP: 192.168.100.165 Name: ElrisonSilva FullName: ElrisonSilva
2025-11-17 16:07:48,862 INFO o.a.j.s.FileServer: Default base='C:\Users\Elris\Documents\projects'
2025-11-17 16:07:48,868 INFO o.a.j.s.FileServer: Set new base='C:\Users\Elris\Documents\projects\jmeter-teastore'
2025-11-17 16:07:49,080 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-11-17 16:07:49,117 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-11-17 16:07:49,120 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-11-17 16:07:49,125 INFO o.a.j.s.SaveService: Loading file: jmeter-teastore\cenarios-complexos.jmx
2025-11-17 16:07:49,157 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2025-11-17 16:07:49,186 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-17 16:07:49,186 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-17 16:07:49,186 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-17 16:07:49,186 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-11-17 16:07:49,186 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-11-17 16:07:49,186 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-11-17 16:07:49,230 INFO o.a.j.JMeter: Creating summariser <summary>
2025-11-17 16:07:49,251 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-11-17 16:07:49,252 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-11-17 16:07:49,252 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-11-17 16:07:49,256 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-11-17 16:07:49,256 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-11-17 16:07:49,370 INFO o.a.j.JMeter: Running test (1763410069370)
2025-11-17 16:07:49,382 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Usuários - Fluxo de Compra
2025-11-17 16:07:49,382 INFO o.a.j.e.StandardJMeterEngine: Starting 10 threads for group Usuários - Fluxo de Compra.
2025-11-17 16:07:49,382 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-11-17 16:07:49,382 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=10 ramp-up=10 delayedStart=false
2025-11-17 16:07:49,400 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-11-17 16:07:49,400 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-11-17 16:07:49,401 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-11-17 16:07:49,401 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-11-17 16:07:49,401 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-11-17 16:07:49,401 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-11-17 16:07:49,403 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-1
2025-11-17 16:07:49,921 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = ElrisonSilva
2025-11-17 16:07:49,925 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-11-17 16:07:50,395 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-2
2025-11-17 16:07:51,395 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-3
2025-11-17 16:07:52,393 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-4
2025-11-17 16:07:53,392 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-5
2025-11-17 16:07:53,537 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-1
2025-11-17 16:07:53,537 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-1
2025-11-17 16:07:54,015 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-2
2025-11-17 16:07:54,015 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-2
2025-11-17 16:07:54,392 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-6
2025-11-17 16:07:54,996 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-3
2025-11-17 16:07:54,996 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-3
2025-11-17 16:07:55,390 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-7
2025-11-17 16:07:56,000 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-4
2025-11-17 16:07:56,000 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-4
2025-11-17 16:07:56,389 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-8
2025-11-17 16:07:56,994 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-5
2025-11-17 16:07:56,994 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-5
2025-11-17 16:07:57,386 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-9
2025-11-17 16:07:57,999 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-6
2025-11-17 16:07:57,999 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-6
2025-11-17 16:07:58,388 INFO o.a.j.t.JMeterThread: Thread started: Usuários - Fluxo de Compra 1-10
2025-11-17 16:07:59,029 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-7
2025-11-17 16:07:59,029 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-7
2025-11-17 16:08:00,034 INFO o.a.j.r.Summariser: summary +     64 in 00:00:11 =    6.0/s Avg:    19 Min:     1 Max:   301 Err:    26 (40.62%) Active: 3 Started: 10 Finished: 7
2025-11-17 16:08:00,036 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-8
2025-11-17 16:08:00,036 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-8
2025-11-17 16:08:01,036 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-9
2025-11-17 16:08:01,036 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-9
2025-11-17 16:08:02,032 INFO o.a.j.t.JMeterThread: Thread is done: Usuários - Fluxo de Compra 1-10
2025-11-17 16:08:02,032 INFO o.a.j.t.JMeterThread: Thread finished: Usuários - Fluxo de Compra 1-10
2025-11-17 16:08:02,033 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-11-17 16:08:02,034 INFO o.a.j.r.Summariser: summary +      6 in 00:00:02 =    3.0/s Avg:     9 Min:     3 Max:    23 Err:     4 (66.67%) Active: 0 Started: 10 Finished: 10
2025-11-17 16:08:02,035 INFO o.a.j.r.Summariser: summary =     70 in 00:00:13 =    5.5/s Avg:    18 Min:     1 Max:   301 Err:    30 (42.86%)